//==========================================
//
//  勝利メッセージ(message_win.cpp)
//  Author : Tomoya Kanazaki
//
//==========================================
#include "message_win.h"
#include "manager.h"
#include "texture.h"

//==========================================
//  コンストラクタ
//==========================================
CMessageWin::CMessageWin()
{

}

//==========================================
//  デストラクタ
//==========================================
CMessageWin::~CMessageWin()
{

}

//==========================================
//  初期化処理
//==========================================
HRESULT CMessageWin::Init(void)
{
	// 初期化
	HRESULT hr = CResultMessage::Init();
	
	// 値を返す
	return S_OK;
}

//==========================================
//  終了処理
//==========================================
void CMessageWin::Uninit(void)
{
	// 終了
	CResultMessage::Uninit();
}

//==========================================
//  更新処理
//==========================================
void CMessageWin::Update(void)
{
	// 更新
	CResultMessage::Update();
}

//==========================================
//  描画処理
//==========================================
void CMessageWin::Draw(void)
{
	// 描画
	CResultMessage::Draw();
}
