//==========================================
//
//  タイトルロゴ(title_logo.cpp)
//  Author : Tomoya Kanazaki
//
//==========================================
#include "title_logo.h"
#include "logo_complete.h"

//==========================================
//  コンストラクタ
//==========================================
CTitleLogo::CTitleLogo()
{
	
}

//==========================================
//  デストラクタ
//==========================================
CTitleLogo::~CTitleLogo()
{

}

//==========================================
//  初期化処理
//==========================================
HRESULT CTitleLogo::Init(void)
{
	//完成したロゴを表示
	CLogo_Comp::Create(D3DXVECTOR3(0.0f, 200.0f, -3600.0f), D3DXVECTOR3(0.0f, 0.0f, 0.0f));

	//タイプの設定
	SetType(TYPE_OBJECT3D);

	return S_OK;
}

//==========================================
//  終了処理
//==========================================
void CTitleLogo::Uninit(void)
{	 
	//オブジェクトの破棄
	Release();
}

//==========================================
//  更新処理
//==========================================
void CTitleLogo::Update(void)
{

}

//==========================================
//  描画処理
//==========================================
void CTitleLogo::Draw(void)
{

}

//==========================================
//  生成処理
//==========================================
CTitleLogo* CTitleLogo::Create()
{
	//インスタンス生成
	CTitleLogo* pLogo = DEBUG_NEW CTitleLogo;

	//初期化処理
	pLogo->Init();

	return pLogo;
}
